In [5]:
import numpy as np
import pandas as pd

In [14]:
df = pd.read_csv('spam.csv', encoding='latin1')

In [15]:
df.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
366,spam,"Update_Now - Xmas Offer! Latest Motorola, Sony...",NaN,NaN,NaN
2261,ham,Did you show him and wot did he say or could u...,NaN,NaN,NaN
5528,ham,Its just the effect of irritation. Just ignore it,NaN,NaN,NaN
5371,ham,"Lol, oh you got a friend for the dog ?",NaN,NaN,NaN
2014,ham,Ambrith..madurai..met u in arun dha marrge..re...,NaN,NaN,NaN

In [17]:
df.shape

(5572, 5)

In [18]:
#1. data cleaning
#2. eda
#3. text preprocessing
#4. model building
#5. evaluation 
#6. improvement
#7. website
#8. deploy

## 1.Data Cleaning

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [20]:
#drop last 3 columns
df.drop(columns=['Unnamed: 2','Unnamed: 3', 'Unnamed: 4'],inplace=True)

In [21]:
df.sample(5)

       v1                                                 v2
309   ham  Where are the garage keys? They aren't on the ...
5306  ham  Ill be at yours in about 3 mins but look out f...
4391  ham                     what are your new years plans?
4372  ham                            Me fine..absolutly fine
3033  ham    Get ready for  &lt;#&gt;  inches of pleasure...

In [23]:
# renaming the cols
df.rename(columns={'v1':'target','v2':'text'},inplace=True)

In [24]:
df.sample(5)

     target                                               text
3464    ham  Haha figures, well I found the piece and prisc...
2333    ham                  What happen to her tell the truth
565     ham  Ill call u 2mrw at ninish, with my address tha...
4753    ham                 Ok lor... Or u wan me go look 4 u?
1034    ham  ZOE IT JUST HIT ME 2 IM FUCKING SHITIN MYSELF ...

In [26]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [27]:
df['target'] = encoder.fit_transform(df['target'])

In [28]:
df.head()

   target                                               text
0       0  Go until jurong point, crazy.. Available only ...
1       0                      Ok lar... Joking wif u oni...
2       1  Free entry in 2 a wkly comp to win FA Cup fina...
3       0  U dun say so early hor... U c already then say...
4       0  Nah I don't think he goes to usf, he lives aro...

In [29]:
# missing values
df.isnull().sum()

target    0
text      0
dtype: int64

In [30]:
# check for duplicate values
df.duplicated().sum()

403

In [31]:
# remove duplicates
df = df.drop_duplicates(keep='first')

In [32]:
df.duplicated().sum()

0

In [33]:
df.shape

(5169, 2)

## 2.EDA